using System;

namespace третий_символ
{
    class Program
    {
        static void Main(string[] args)
        {
            //Дано слово. Вывести на экран его третий символ.

            string a = Console.ReadLine();

            Console.WriteLine(a[2]);
        }
    }
}
