using System;

namespace символы
{
    class Program
    {
        static void Main(string[] args)
        {
            //Т4.1.Дано предложение.Напечатать все его символы, предшествующие первой запятой. Рассмотреть два случая:
            //1) известно, что в предложении запятые имеются;
            //2) в предложении запятых может не быть.

            string a = "Речь человека состоит из предложений, причем определить, о чем он говорит, зачастую можно, только найдя грамматическую основу этого предложения – подлежащее и сказуемое";

            int b = 0;

            Console.WriteLine("1) известно, что в предложении запятые имеются;");

            for (int i = 0; i < a.Length; i++)
            {
                if (',' == a[i])
                {
                    break;
                }

                else
                {


                    Console.Write(a[i]);
                }
            }

            for (int i = 0; i < a.Length; i++)
            {
                if (',' != a[i])
                {
                    b += 1;
                }

                else
                {
                    break;
                }
            }

            Console.WriteLine((a.Remove(0, b + 2)));
        }
    }
}
